#!/usr/bin/python
# -*- coding: UTF-8 -*-

import sys

reload(sys)
sys.setdefaultencoding('utf-8')
'''
# 1.有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
m=0
for i in  range(1,5):
    for j in range(1,5):
        for k in range(1,5):
            if (i!=j) and(i!=k) and (j!=k):
                m=m+1
                print int(str(i)+str(j)+str(k))
print '无重复的数字有%d个'%(m)
'''
#2.企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

i = int(raw_input('请输入当月利润:'))
if i<=100000:
    m=float(i*0.1)
    print '当月应发放奖金为：',m
elif 100000<i<200000:
    m=float(100000 * 0.1 +(i-100000)*0.075)
    print '当月应发放奖金为：', m
elif 200000 <= i <=400000:
    m=float(100000*0.1+100000*0.075+(i-200000)*0.05)
    print '当月应发放奖金为：', m
elif 400000 <= i <=600000:
    m = float(100000 * 0.1 + 100000 * 0.075 +200000 *0.05 + (i - 400000) * 0.03)
    print '当月应发放奖金为：', m
elif 600000 <= i <=1000000:
    m = float(100000 * 0.1 + 100000 * 0.075 +200000 *0.05 + 200000 * 0.03 +(i-600000) *0.015)
    print '当月应发放奖金为：', m
else:
    m = float(100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015+(i-1000000)*0.01)
    print '当月应发放奖金为：', m

#2.另一种方法

i = int(raw_input('净利润:'))
arr = [1000000,600000,400000,200000,100000,0]
rat = [0.01,0.015,0.03,0.05,0.075,0.1]
r = 0
for idx in range(0,6):
    if i>arr[idx]:
        r+=(i-arr[idx])*rat[idx]
        print (i-arr[idx])*rat[idx]
        i=arr[idx]
print r

